УТ/src/DataProcessors/CRM_АРМ_Поддержка/CRM_АРМ_Поддержка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_АРМ_Поддержка</name>
</mdclass:DataProcessor>

УТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТехподдержкаЛогинПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_Теги/CRM_Теги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Теги</name>
  <owners>Catalog.СтруктураПредприятия</owners>
  <attributes>
    <name>ЦветКрасный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗеленый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСиний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_АРМ_Поддержка/Forms/ФормаФильтра/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодразделения = CRM_ОбщегоНазначенияПовтИсп.ИспользоватьПодразделения();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураФильтра);
	ТекущийПользовательСтарый = ТекущийПользователь;
	Если ТипЗнч(ТекущийПользователь) <> Тип("СправочникСсылка.Пользователи") Тогда
		ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	//ПараметрыВыбораПользователь = Новый Массив;
	//ПараметрыВыбораПользователь.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		// ПараметрыСеанса.CRM_ДоступныеПользователи));
	//Элементы.ТекущийПользователь.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПользователь);
	
	Если НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТеги") Тогда
		Элементы.ГруппаТэги.Видимость = Ложь;
	Иначе
		Если ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			ОтборПодразделениеДляТегов = ТекущийПользователь.Подразделение;
			СписокВышестоящихПодразделений.ЗагрузитьЗначения(CRM_МетодыМодулейМенеджеровСправочников.ПолучитьВсеПодразделенияРодители(ОтборПодразделениеДляТегов,
				 Истина));
			ОбновитьЗначенияОтбораТеговСервер();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяРоль) Тогда
		ТекущаяРоль = НСтр("ru = '<Все роли>'; en = '<All roles>'");
	КонецЕсли;
	
	Элементы.ПоискПодразделение.Видимость = ИспользоватьПодразделения;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьТекущийВариантПериода();
	ИзменитьОтображениеПолейОтборов();
	ЗаполнитьСписокРолейПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПослеСозданияТега" И (Источник = Элементы.Тег) Тогда
		Тег = Параметр;
		ДобавитьТэг();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущийПользовательПриИзменении(Элемент)
	ТекущийПользовательПриИзмененииНаСервере();
	Подключаемый_ТегОтборНажатие(Элементы.Тег_Очистить, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Тег".
//
Процедура ТегПриИзменении(Элемент)
	ДобавитьТэг();
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Создание" элемента формы "Тег".
//
Процедура ТегСоздание(Элемент, СтандартнаяОбработка)
	CRM_ТегиКлиент.ТегСоздание(Элемент, СтандартнаяОбработка, ОтборПодразделениеДляТегов);
	ДобавитьТэг();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСозданыСегодняНажатие(Элемент)
	Если Элемент.Имя = "ОтборСозданыСегодня" Тогда
		ВариантПериода = "Сегодня";
	ИначеЕсли Элемент.Имя = "ОтборСозданыЗа3Дня" Тогда
		ВариантПериода = "3 дня";
	ИначеЕсли Элемент.Имя = "ОтборСозданыЗаНеделю" Тогда
		ВариантПериода = "Неделя";
	ИначеЕсли Элемент.Имя = "ОтборСозданыЗаМесяц" Тогда
		ВариантПериода = "Месяц";
	ИначеЕсли Элемент.Имя = "ОтборОчистить" Тогда
		ВариантПериода = "";	
	КонецЕсли;	
	ПоказатьТекущийВариантПериода();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяРоль = НСтр("ru = '<Все роли>'; en = '<All roles>'");
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ТекущаяРольЗавершениеВыбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.РолиИсполнителей.ФормаВыбора", , ЭтотОбъект, , , , Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольЗавершениеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяРоль = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРольАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ТипЗнч(ТекущаяРоль) = Тип("Строка") Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.РолиИсполнителей");
		ТекущаяРоль = ОписаниеТипа.ПривестиЗначение(ТекущаяРоль);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	Закрыть(ПолучитьСтруктуруФильтра());
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьНаСервере();
	ИзменитьОтображениеПолейОтборов();
	Подключаемый_ТегОтборНажатие(Элементы.Тег_Очистить, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТегОтборОчистить(Команда)
	Подключаемый_ТегОтборНажатие(Элементы.Тег_Очистить, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодОчистить(Команда)
	ВариантПериода = "";
	ПоказатьТекущийВариантПериода();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоле(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	Если НЕ Элементы.ГруппаТекущаяРоль.Видимость Тогда
		СписокВыбора.Добавить("Роль", НСтр("ru = 'Роль     '; en = 'Role     '"));
	КонецЕсли;
	Если НЕ Элементы.ГруппаТекущийАвтор.Видимость Тогда
		СписокВыбора.Добавить("Автор", НСтр("ru = 'Автор    '; en = 'Author    '"));
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьПолеЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(Оповещение, СписокВыбора, ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеЗавершение(Результат, ДополнитлеьныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "Роль" Тогда
		Элементы.ГруппаТекущаяРоль.Видимость = Истина;
		ОтборПоРолиУстановлен = Истина;
	ИначеЕсли Результат.Значение = "Автор" Тогда
		Элементы.ГруппаТекущийАвтор.Видимость = Истина;
	КонецЕсли;
	
	ИзменитьОтображениеКнопкиСоздания();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоле(Команда)
	
	Если Команда.Имя = "УдалитьПолеТекущаяРоль" Тогда
		Элементы.ГруппаТекущаяРоль.Видимость = Ложь;
		ОтборПоРолиУстановлен = Ложь;
	ИначеЕсли Команда.Имя = "УдалитьПолеТекущийАвтор" Тогда
		Элементы.ГруппаТекущийАвтор.Видимость = Ложь;
	КонецЕсли;
	
	ИзменитьОтображениеКнопкиСоздания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗначенияОтбораТеговСервер()
	
	//
	МассивУдаляемыхЭлементов = Новый Массив;
	Для Каждого Элемент Из Элементы.ГруппаТэги.ПодчиненныеЭлементы Цикл
		МассивУдаляемыхЭлементов.Добавить(Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_Теги.Ссылка КАК Тег,
		|	CRM_Теги.ЦветКрасный КАК ЦветКрасный,
		|	CRM_Теги.ЦветЗеленый КАК ЦветЗеленый,
		|	CRM_Теги.ЦветСиний КАК ЦветСиний,
		|	CRM_Теги.ЦветПредставление КАК ЦветПредставление
		|ИЗ
		|	Справочник.CRM_Теги КАК CRM_Теги
		|ГДЕ
		|	CRM_Теги.Ссылка В(&МассивТегов)";
	Запрос.УстановитьПараметр("МассивТегов", ОтборТеги.ВыгрузитьЗначения());
	
	ЦветаТегов = Запрос.Выполнить().Выгрузить();
	
	НомерЭлемента = 0;
	НомерСтрокиЭлементов = 0;
	ТекущаяДлинаСтроки = 0;
	ЭлементовВГруппе = 0;
	Для Каждого ЭлементОтбораТег Из ОтборТеги Цикл
		ЭлементОтбораТег.Пометка = Ложь;
		Если СтрДлина(ЭлементОтбораТег.Представление) > 15 Тогда
			ПредставлениеТега = СокрЛП(Лев(ЭлементОтбораТег.Представление, 15)) + "...";
			ТекущаяДлинаСтроки = ТекущаяДлинаСтроки + 15;
		Иначе
			ПредставлениеТега = СокрЛП(ЭлементОтбораТег.Представление);
			ТекущаяДлинаСтроки = ТекущаяДлинаСтроки + СтрДлина(ПредставлениеТега);
		КонецЕсли;
		
		Если НомерСтрокиЭлементов = 0 Или ТекущаяДлинаСтроки > 30 Тогда
			
			ТекущаяДлинаСтроки = СтрДлина(ПредставлениеТега);
			НомерСтрокиЭлементов = НомерСтрокиЭлементов + 1;
			
			ГруппаТегов = Элементы.Добавить("СтрокаТегов" + НомерСтрокиЭлементов, Тип("ГруппаФормы"), Элементы.ГруппаТэги);
			ГруппаТегов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаТегов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаТегов.ОтображатьЗаголовок = Ложь;
			ГруппаТегов.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаТегов.РастягиватьПоВертикали = Ложь;
			ГруппаТегов.Высота = 1;
			ЭлементовВГруппе = 0;
		КонецЕсли;
		
		ЦветТега = ЦветаТегов.Найти(ЭлементОтбораТег.Значение, "Тег");
		ЦветФонаТега = Неопределено;
		ЦветТекстаТега = ЦветаСтиля.CRM_ОсновнойГолубой;
		Если ЦветТега <> Неопределено И ЗначениеЗаполнено(ЦветТега.ЦветПредставление) Тогда
			// BSLLS:StyleElementConstructors-off
			ЦветФонаТега = Новый Цвет(ЦветТега.ЦветКрасный, ЦветТега.ЦветЗеленый, ЦветТега.ЦветСиний);
			// BSLLS:StyleElementConstructors-on
			ЦветТекстаТега = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(ЦветФонаТега);
		КонецЕсли;
		
		ТегФорматированнаяСтрока = Новый ФорматированнаяСтрока(ПредставлениеТега, , ЦветТекстаТега, ЦветФонаТега);
		КнопкаУдалитьТегФоматированнаяСтрока = Новый ФорматированнаяСтрока(БиблиотекаКартинок.CRM_УдалитьСиняя, , , , "Тег_"
			+ ЭлементОтбораТег.ПолучитьИдентификатор());
		
		ЭлементыЗаголовка = Новый Массив;
		ЭлементыЗаголовка.Добавить(ТегФорматированнаяСтрока);
		ЭлементыЗаголовка.Добавить(КнопкаУдалитьТегФоматированнаяСтрока);
		
		ЭлементТег = Элементы.Добавить("Тег_" + ЭлементОтбораТег.ПолучитьИдентификатор(), Тип("ДекорацияФормы"), ГруппаТегов);
		ЭлементТег.Вид = ВидДекорацииФормы.Надпись;
		ЭлементТег.Заголовок = Новый ФорматированнаяСтрока(ЭлементыЗаголовка);
		ЭлементТег.Гиперссылка = Истина;
		ЭлементТег.Подсказка = ЭлементОтбораТег.Представление;
		ЭлементТег.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементТег.АвтоМаксимальнаяШирина = Ложь;
		ЭлементТег.Ширина =  Окр(СтрДлина(ПредставлениеТега) * 0.8 + 4);
		ЭлементТег.РастягиватьПоГоризонтали = Ложь;
		ЭлементТег.УстановитьДействие("Нажатие", "Подключаемый_ТегОтборНажатие");
		ЭлементовВГруппе = ЭлементовВГруппе + 1;
		НомерЭлемента = НомерЭлемента + 1;
		
	КонецЦикла;
	//
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТегОтборНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	Если Элемент.Имя = "Тег_Очистить" Тогда
		ОтборТеги.Очистить();
	Иначе	
		ВыбранныйТег = ОтборТеги.НайтиПоИдентификатору(Число(СтрЗаменить(Элемент.Имя, "Тег_", "")));
		ОтборТеги.Удалить(ВыбранныйТег);
	КонецЕсли;
	ОбновитьЗначенияОтбораТеговСервер();	
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекущийВариантПериода()
	Если ВариантПериода = "Сегодня" Тогда
		Элементы.ОтборСозданыСегодня.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыСегодня.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	ИначеЕсли ВариантПериода = "3 дня" Тогда
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = Новый Цвет(255, 255, 255);
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборОчистить.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборОчистить.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
	Иначе
		Элементы.ОтборСозданыЗаМесяц.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаМесяц.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗа3Дня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗа3Дня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыЗаНеделю.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыЗаНеделю.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
		
		Элементы.ОтборСозданыСегодня.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.ОтборСозданыСегодня.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;	
		
		Элементы.ОтборОчистить.ЦветФона = ЦветаСтиля.CRM_ОсновнойГолубой;
		Элементы.ОтборОчистить.ЦветТекста = Новый Цвет(255, 255, 255);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруФильтра()
	СтруктураФильтра = Новый Структура;
	СтруктураФильтра.Вставить("СкрытьПропущенныеТелефонныеЗвонки", СкрытьПропущенныеТелефонныеЗвонки);
	СтруктураФильтра.Вставить("СкрытьОтвеченныеТелефонныеЗвонки", СкрытьОтвеченныеТелефонныеЗвонки);
	СтруктураФильтра.Вставить("СкрытьЗаявки", СкрытьЗаявки);
	СтруктураФильтра.Вставить("СкрытьСообщения", СкрытьСообщения);
	СтруктураФильтра.Вставить("ОтборТеги", ОтборТеги);
	СтруктураФильтра.Вставить("ОтображатьПисьма", ОтображатьПисьма);
	СтруктураФильтра.Вставить("СкрытьКолонкуОбращения", СкрытьКолонкуОбращения);
	СтруктураФильтра.Вставить("СкрытьПовторныеОбращения", СкрытьПовторныеОбращения);
	СтруктураФильтра.Вставить("ВариантПериода", ВариантПериода);
	СтруктураФильтра.Вставить("ПоискКлиент", ПоискКлиент);
	СтруктураФильтра.Вставить("ПоискПодразделение", ПоискПодразделение);
	СтруктураФильтра.Вставить("ПоискТипУслуги", ПоискТипУслуги);
	СтруктураФильтра.Вставить("ТекущийПользователь", ТекущийПользователь);
	СтруктураФильтра.Вставить("НуженОтвет", НуженОтвет);
	СтруктураФильтра.Вставить("Просрочено", Просрочено);
	СтруктураФильтра.Вставить("ОтборКаналПолучения", ОтборКаналПолучения);
	СтруктураФильтра.Вставить("ОтборПоРолиУстановлен", ОтборПоРолиУстановлен);
	СтруктураФильтра.Вставить("ТекущаяРоль", ?(ТипЗнч(ТекущаяРоль) = Тип("СправочникСсылка.РолиИсполнителей")
		 И ОтборПоРолиУстановлен,
		 ТекущаяРоль, Справочники.РолиИсполнителей.ПустаяСсылка()));
	СтруктураФильтра.Вставить("ТекущийАвтор", ?(Элементы.ГруппаТекущийАвтор.Видимость, ТекущийАвтор,
		 Справочники.Пользователи.ПустаяСсылка()));
	
	Возврат СтруктураФильтра;
КонецФункции	

&НаСервере
Процедура ОчиститьНаСервере()
	ПоискКлиент = Справочники.Партнеры.ПустаяСсылка();
	ПоискПодразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	ПоискТипУслуги = Справочники.CRM_ТипУслуги.ПустаяСсылка();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущаяРоль = НСтр("ru = '<Все роли>'; en = '<All roles>'");
	ОтборПоРолиУстановлен = Истина;
	ТекущийАвтор = Справочники.Пользователи.ПустаяСсылка();
	НуженОтвет = Ложь;
	Просрочено = Ложь;
	ВариантПериода = "";
	ОтборКаналПолучения = Неопределено;
	ПоказатьТекущийВариантПериода();
КонецПроцедуры

&НаСервере
Процедура ТекущийПользовательПриИзмененииНаСервере()
	Если ТекущийПользовательСтарый <> ТекущийПользователь Тогда
		ОтборТеги.Очистить();
		Если ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			Подразделение = ТекущийПользователь.Подразделение;
		КонецЕсли;
		СписокВышестоящихПодразделений.ЗагрузитьЗначения(CRM_МетодыМодулейМенеджеровСправочников.ПолучитьВсеПодразделенияРодители(Подразделение,
			 Истина));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьТэг()
	
	Если НЕ ЗначениеЗаполнено(Тег) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтборТеги.НайтиПоЗначению(Тег) = Неопределено Тогда
		ОтборТеги.Добавить(Тег, Тег.Наименование, Истина);
		ОбновитьЗначенияОтбораТеговСервер();
		
	КонецЕсли;
	
	Тег = ПредопределенноеЗначение("Справочник.CRM_Теги.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеПолейОтборов()
	
	Элементы.ГруппаТекущаяРоль.Видимость = ЗначениеЗаполнено(ТекущаяРоль) И ОтборПоРолиУстановлен;
	Элементы.ГруппаТекущийАвтор.Видимость = ЗначениеЗаполнено(ТекущийАвтор);
	ИзменитьОтображениеКнопкиСоздания();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеКнопкиСоздания()
	
	Элементы.ДобавитьПолеТекущийПользователь.Видимость = НЕ Элементы.ГруппаТекущаяРоль.Видимость
		 И НЕ Элементы.ГруппаТекущийАвтор.Видимость;
	Элементы.ДобавитьПолеТекущаяРоль.Видимость         = Элементы.ГруппаТекущаяРоль.Видимость
		 И НЕ Элементы.ГруппаТекущийАвтор.Видимость;
	Элементы.ДобавитьПолеТекущийАвтор.Видимость        = НЕ Элементы.ГруппаТекущаяРоль.Видимость
		 И Элементы.ГруппаТекущийАвтор.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРолейПользователя()
	
	Элементы.ТекущаяРоль.СписокВыбора.Очистить();
	Элементы.ТекущаяРоль.СписокВыбора.Добавить(НСтр("ru = '<Все роли>'; en = '<All roles>'"));
	
КонецПроцедуры

#КонецОбласти
